//---------------------------------------------------------------------------

#pragma hdrstop
#include <stdio.h>
#include <conio.h>


//---------------------------------------------------------------------------
// Программа выводит на консоль числа различных типов
//
//---------------------------------------------------------------------------

#pragma argsused

int main(int argc, char* argv[])
{char i; 
 int j;
 float f, f1, f2;           // Объявляем переменные
 long double d, d1, d2;

 printf("Example for first lection \n\n");

 i=1;
 j=-123456789;

 printf("i= %d \n",i);
 printf("j= %d \n",j);// Вывод на консоль целых чисел

 f1=3.25;
 f2=4.75;
 f=f1+f2;

 printf("f= %f \n",f); // Вывод на консоль вещественных
                       // чисел типа float или double

 d1=3.25E00;
 d2=4.75E00;
 d=d2-d1;

 printf("d= %LE \n\n",d); // Вывод на консоль вещественных чисел
 //printf("d= %Lf \n\n",d); // типа long double

 printf("OK");
 getch();
        return 0;
}
//---------------------------------------------------------------------------
