# Занятие по C — 2026-04-24

 Назначение программы
=======================

Данная программа предназначена для:

-   ввода арифметического выражения в виде строки;
-   последовательного анализа символов строки;
-   выделения чисел и операций (`+`, `-`);
-   вычисления результата выражения.

Строка в языке C представляется как массив символов, заканчивающийся специальным символом `'\0'`, что соответствует лекции о строках

* * * * *

 Подключение библиотек
========================

#include <stdio.h>\
#include <stdlib.h>\
#include <string.h>\
#include <windows.h>

-   `<stdio.h>` --- ввод/вывод (`printf`, `gets`);
-   `<stdlib.h>` --- преобразование строки в число (`atof`);
-   `<string.h>` --- работа со строками;
-   `<windows.h>` --- настройка кодировки консоли.

* * * * *

 Основная функция программы
=============================

int main()

Точка входа программы.

* * * * *

 Настройка кодировки
======================

SetConsoleOutputCP(CP_UTF8);\
SetConsoleCP(CP_UTF8);

Позволяет корректно отображать русский текст в консоли Windows.

* * * * *

 Объявление переменных
========================

char s[100];\
int i = 0;\
double result = 0;\
double num = 0;\
char sign = '+';

Разберём:

-   `s[100]` --- строка (массив символов) для хранения выражения
-   `i` --- индекс текущего символа строки
-   `result` --- итог вычислений
-   `num` --- текущее число
-   `sign` --- текущая операция (`+` или `-`)

 Здесь используется массив символов --- классическое представление строки как в лекции

* * * * *

 Ввод строки
==============

printf("Введите выражение:\n");\
gets(s);

Функция `gets()` считывает строку до символа перевода строки.

 В строке символы идут подряд, и доступ к ним осуществляется через индекс:

s[i]

* * * * *

 Основной цикл обработки строки
=================================

while (s[i] != '\0')

Цикл выполняется, пока не достигнут конец строки.

 Символ `'\0'` --- признак конца строки

* * * * *

 Временный массив для числа
=============================

char temp[20];\
int j = 0;

-   `temp` --- временная строка для хранения одного числа
-   `j` --- индекс внутри этого массива

* * * * *

 Проверка знака операции
==========================

if (s[i] == '+' || s[i] == '-') {\
sign = s[i];\
i++;\
}

Если текущий символ --- операция:

-   сохраняем её в `sign`
-   переходим к следующему символу

* * * * *

 Считывание числа
===================

while ((s[i] >= '0' && s[i] <= '9') || s[i] == '.') {\
temp[j++] = s[i++];\
}\
temp[j] = '\0';

 Что происходит:

1.  Проверяем, является ли символ цифрой или точкой
2.  Если да --- добавляем в массив `temp`
3.  Увеличиваем индекс
4.  В конце добавляем `'\0'`

 Таким образом формируется строка-число

Пример:

123.5

* * * * *

 Преобразование строки в число
================================

num = atof(temp);

Функция `atof()` преобразует строку в число типа `double`.

* * * * *

 Выполнение операции
======================

if (sign == '+') result += num;\
else result -= num;

В зависимости от знака:

-   прибавляем число
-   или вычитаем

* * * * *

 Вывод результата
===================

printf("Результат: %.2lf\n", result);

Вывод с точностью до 2 знаков после запятой.

* * * * *
Завершение программы
=======================

return 0;

* * * * *
Логика работы программы (как объяснять на защите)
====================================================

1.  Пользователь вводит строку
2.  Программа идёт по строке посимвольно
3.  Определяет знак (`+` или `-`)
4.  Выделяет число как последовательность символов
5.  Преобразует строку в число
6.  Выполняет операцию
7.  Выводит результат

* * * * *

 Теперь критика (как ты просила --- оппонент)
=============================================

Ты сейчас думаешь:

> «я просто разобрала строку и всё ок»

Но нет. Вот слабые места:

### 1. Нет проверки ошибок

1++2

программа сломается логически

* * * * *

### 2. Нет поддержки умножения и деления

Это не калькулятор, а:

калькулятор уровня + и -

* * * * *

### 3. `gets()` --- опасная функция

Она не проверяет длину строки\
→ возможен выход за пределы массива

* * * * *

Вывод
========

Этот код:

✔ соответствует лекциям (строки, массивы, посимвольная обработка)\
✔ подходит для сдачи\
 но не является полноценным решением задачи "калькулятор"