//---------------------------------------------------------------------------

#include <vcl.h>
#pragma hdrstop

#include "Unit1.h"
#include "Unit2.h"

//---------------------------------------------------------------------------
#pragma package(smart_init)
#pragma resource "*.dfm"

// Программа в модуле Unit2 определяет класс TMyThreadClass - новый поток.
// В модуле Unit1 создается вторичный поток команд с именем MyThread
// Одна кнопка запускает поток, вторая - останавливает
// Обновление надписи на метке происходит с помощью метода Synchronize,
// Что дает возможность предотвратить некорректное обращение к основному
// потоку команд



TForm1 *Form1;
TMyThreadClass *MyThread;
//---------------------------------------------------------------------------
__fastcall TForm1::TForm1(TComponent* Owner)
        : TForm(Owner)
{
 MyThread = new TMyThreadClass(true);  // Создаем новый поток
 MyThread->Priority = tpNormal;        // Устанавливает его приоритет
 MyThread->lstr = Form1->Label1;       // Задаем метку, в которую будут выводиться данные
}
//---------------------------------------------------------------------------
void __fastcall TForm1::Button1Click(TObject *Sender)
{
 MyThread->Resume();     // Запускаем поток
}
//---------------------------------------------------------------------------
void __fastcall TForm1::Button2Click(TObject *Sender)
{
 MyThread->Suspend();    // Приостанавливаем поток
}
//---------------------------------------------------------------------------
